{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2019-2023",
      "school_name": "York university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MuneebAhmed",
  "highlighted_projects": [
    {
      "description": "Developed a serverless bird identification learning website using Next.js, Mantine, and AWS Amplify, incorporating GraphQL, DynamoDB, and AWS S3 for data management and storage. I also integrated AWS authentication to enhance user experience by tracking and saving individual progress.",
      "git_url": "",
      "name": "Rookery"
    },
    {
      "description": "Built FitAI, a Next.js web application designed to help users craft personalized workout plans. Leveraging Firebase for secure user authentication and real-time database updates, along with the OpenAI API for generating customized workout content, this tool combines AI with fitness. The user interface, developed with Mantine, ensures a seamless and intuitive user experience. Key features include secure login, AI-generated workout plans tailored to user preferences, and a dynamic database for real-time tracking. FitAI stands out for its modern, user-friendly interface and personalized approach to fitness planning.",
      "git_url": "https://github.com/ryzzer0/FitAI",
      "name": "FitAI"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring Agent to monitor hardware specs and usage across Linux clusters. Used Bash for automation, PostgreSQL for data management, Docker for container management, and Git for version control. The project simplifies system monitoring with automated scripts and a PostgreSQL database, enabling system admins and developers to optimize performance. Features include real-time data collection, automated database updates, and essential insights into system health. Future plans include updating hardware spec changes and integrating data visualization tools.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MuneebAhmed/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Muneeb Ahmed",
  "others": [
    {
      "bullets": [
        "Semi-Professional Esports Player",
        "Graphic Designing",
        "Volunteer, NEST: Volunteered for event management for Esports Tournaments at NEST"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed comprehensive full-stack software solutions as part of Jarvis's team, focusing on leveraging Java, Linux/Bash, RDBMS/SQL, Agile/Scrum methodologies, and Git for efficient project management and deployment. Collaborated closely with cross-functional teams to design, implement, and refine scalable applications, enhancing business operations and user experiences",
      "duration": "2024-present",
      "title": "Technical Consultant"
    },
    {
      "company": "AiFocal Inc.",
      "description": "Led the Defai project at AiFocal, utilizing Next.js, TypeScript, Tailwind CSS, and OpenAI API to create a no-code platform for AI chatbot integration with messaging platforms like WhatsApp. Developed the front-end UI and architecture and collaborated with back-end teams to ensure high traffic management, robust security, and user-friendly UI/UX design.",
      "duration": "2023-2023",
      "title": "Software Engineer"
    },
    {
      "company": "Boop",
      "description": "Engineered and maintained front-end components for Boop's web presence, employing Next.js, TypeScript, and Tailwind CSS to deliver a responsive and intuitive user experience. Designed and implemented company's website and business portal, focusing on performance optimization and cross-browser compatibility.",
      "duration": "2023-2023",
      "title": "Software Engineer"
    },
    {
      "company": "Rove",
      "description": "Contributed to client-side projects at Rove, focusing on creating responsive and accessible applications using React, Mantine, Node.js, and Tailwind CSS. Ensured seamless functionality across different devices and browsers using BrowserStack. Integrated APIs and participated in Agile/Scrum processes for iterative development and continuous improvement.",
      "duration": "2020-2021",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Nextjs/React",
      "JavaScript/TypeScript",
      "Nodejs",
      "Docker",
      "Python"
    ],
    "familiar": [
      "AWS",
      "LangChain/Flowise",
      "Python",
      "Redux",
      "C"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from York University, where I earned a Bachelor's degree in Computer Science. At AiFocal, I led the development of the Defai project, which enabled users to create AI chatbots without coding, as well as integrating with messaging platforms like WhatsApp. My experience includes working with frontend technologies such as Next.js, React, TypeScript, and Tailwind CSS. I also contributed to backend components to ensure functionality, security, and accessibility for high-traffic web applications. I am enthusiastic to bring my experience and expertise to new challenges in the software industry. My goal is to develop products that make technology accessible and efficient for everyone."
}
